OpenAtomFoundation/TobudOS/platform/vendor_bsp/nationz/N32G020XX/cmsis/cm0/device/n32g020xx/n32g020xx.h
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
 * @file n32g020xx.h
 * @author Nations Solution Team
 * @version v1.0.1
 * @brief N32G020基本配置定义文件。
 * 
 * @copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
 * 
 * @defgroup N32G020 N32G020基本配置
 * @{
 */
#ifndef __N32G020XX_H__
#define __N32G020XX_H__

#include <stdint.h>
#include <stddef.h>
#ifdef __cplusplus
extern "C"
{
#endif


/**
  * @brief Configuration of the Cortex-M0 Processor and Core Peripherals 
  */
#define __NVIC_PRIO_BITS          2 /*!< n32g020 uses 2 Bits for the Priority Levels      */
#define __Vendor_SysTickConfig    0 /*!< Set to 1 if different SysTick Config is used  */

   
   
/**
 * @brief n32n032 Interrupt Number Definition
 * 
 */

/*!< Interrupt Number Definition */
typedef enum
{
/******  Cortex-M0 Processor Exceptions Numbers ******************************************************/
    NMI_IrqNum                = -14,    /*!< 2 Non Maskable Interrupt                                */
    HardFault_IrqNum          = -13,    /*!< 3 Cortex-M0+ Hard Fault Interrupt                       */

    SVCall_IrqNum             = -5,     /*!< 11 Cortex-M0+ SV Call Interrupt                         */

    PendSV_IrqNum             = -2,     /*!< 14 Cortex-M0+ Pend SV Interrupt                         */
    SysTick_IrqNum            = -1,     /*!< 15 Cortex-M0+ System Tick Interrupt                     */
    SysTick_IRQn              = -1,     /*!< 15 Cortex-M0+ System Tick Interrupt                     */

/******  n32g020 specific Interrupt Numbers **********************************************************/
    Wdt_Exception_IrqNum      = 0,      
    Flash_Exception_IrqNum    = 3,
    Timer0_Exception_IrqNum   = 5,
    Timer1_Exception_IrqNum   = 6,
    Timer2_Exception_IrqNum   = 7,
    Timer3_Exception_IrqNum   = 8,
    Timer4_Exception_IrqNum   = 9,
    Pmu_Exception_IrqNum      = 10,
    Iom_Exception_IrqNum      = 11,
    Dmac_Exception_IrqNum     = 14,
    Usb_Exception_IrqNum      = 15,
    Ucdr_Exception_IrqNum     = 16,
    Scd_Exception_IrqNum      = 17,
    Scc_Exception_IrqNum      = 18,
    Spim0_Exception_IrqNum    = 19,
    Spim1_Exception_IrqNum    = 20,
    Spis0_Exception_IrqNum    = 21,
    Spis1_Exception_IrqNum    = 22,
    Uart0_Exception_IrqNum    = 23,
    Uart1_Exception_IrqNum    = 24,
    Uart2_Exception_IrqNum    = 25,
    Rtc_Exception_IrqNum      = 26,
    Adc_Dac_Exception_IrqNum  = 27,     /*!< ADC/DAC中断信号由AdcDacCtrl控制共享1个中断                */
    RcvCnt_Exception_IrqNum   = 28,     /*!< RcvCnt中断请求                               */
    I2c0_Exception_IrqNum     = 29,
    I2c1_Exception_IrqNum     = 30,
    Pwm_Exception_IrqNum      = 31,
} IRQn_Type;


#include "core_cm0.h"
// #include <stdint.h>

//------------------------------------------------------------------------------
//                        CHIP INFORMATION
//------------------------------------------------------------------------------
/* IP FEATURES */
#define DMAC_MAX_CHANNEL (8)

//------------------------------------------------------------------------------
//                       REGISTER BASE INFORMATION
//------------------------------------------------------------------------------
#define ACTLR                                                                  \
    (*((volatile unsigned long*)(0xE000E008))) // The Auxiliary Control
// Register,
// #define SCB_BASE (0xE000ED00) // System Control Block.0xE000ED00-0xE000ED8F
#define DMA_BASE (0x40000000)
#define ARAM_BASE (0x40200000)
#define FLASH_BASE (0x40400000)
#define CRC_BASE (0x40500000)
#define USB_BASE (0x40600000)
#define USBDC_BASE (USB_BASE + 0x27C)
#define SPIM0_BASE (0x40700000)
#define SPIM1_BASE (0x40700400)
#define ICACHE_BASE (0x40800000)
#define SPIS0_BASE (0x50000000)
#define SPIS1_BASE (0x50000400)
#define I2C0_BASE (0x50200000)
#define I2C1_BASE (0x50200400)
#define TIMER0_BASE (0x50300000)
#define TIMER1_BASE (0x50300020)
#define TIMER2_BASE (0x50300040)
#define TIMER3_BASE (0x50300060)
#define TIMER4_BASE (0x50300080)
#define SCC_BASE (0x50400000)
#define SCD_BASE (0x50500000)
#define ADC_BASE (0x50700000)
#define PWM_BASE (0x50800000)
#define PWM0_BASE (PWM_BASE)
#define PWM1_BASE (PWM_BASE + 0x50)
#define PWM2_BASE (PWM_BASE + 0xA0)
#define PWM3_BASE (PWM_BASE + 0xF0)
#define PWM4_BASE (PWM_BASE + 0x140)
#define PWM5_BASE (PWM_BASE + 0x190)
#define PWM6_BASE (PWM_BASE + 0x1E0)
#define PWM7_BASE (PWM_BASE + 0x230)
#define PWMGLB_BASE (PWM_BASE + 0x280)
#define DAC_BASE (0x50900000)
#define UART0_BASE (0x50C00000)
#define UART1_BASE (0x50C00400)
#define UART2_BASE (0x50C00800)
#define UART_BASE (0x50C00000)
#define CGU_BASE (0x60000000)
#define RCU_BASE (0x60100000)
#define SMC_BASE (0x60200000)
#define PMU_BASE (0x60300000)
#define IOM_BASE (0x60500000)
#define WDT_BASE (0x60600000)
#define RNG_BASE (0x60800000)
#define RETPMU_BASE (0x60800000)
#define UCDR_BASE (0x60A00000)
#define RCVCNT_BASE (0x60B00000)
#define RCVCNT_INT_BASE (0x60C00080)
#define AFEC_BASE (0x60D00000)
#define RTC_BASE (0x60E00000)
#define ADCDAC_BASE (0x50700000+0x20)
#define DACOUT_BASE (0x60C00000)


//------------------------------------------------------------------------------
//                       REGISTER INFORMATION
//------------------------------------------------------------------------------
// ARM
typedef struct
{
    volatile uint32_t CPUID; //(*((volatile unsigned long *)(SCB_BASE + //0x000)))//CPUID Base Register on page B3-264
    volatile uint32_t ICSR; //(*((volatile unsigned long *)(SCB_BASE + 0x004)))//Interrupt Control State Register, ICSR on page B3-265
    volatile uint32_t VTOR; //(*((volatile unsigned long *)(SCB_BASE + 0x008)))//Vector Table Offset Register, VTOR on page B3-267
    volatile uint32_t AIRCR; //(*((volatile unsigned long *)(SCB_BASE + 0x00C)))//Application Interrupt and Reset Control Register,AIRCR on page B3 - 268
    volatile uint32_t SCR; //(*((volatile unsigned long *)(SCB_BASE + 0x010)))//Optional System Control Register, SCR on page B3-269
    volatile uint32_t CCR; //(*((volatile unsigned long *)(SCB_BASE + 0x014)))//Configuration and Control Register, CCR on page B3 - 271
    volatile uint32_t SHPR2; //(*((volatile unsigned long *)(SCB_BASE + 0x01C)))//System Handler Priority Register 2, SHPR2 on page B3 - 272
    volatile uint32_t SHPR3; //(*((volatile unsigned long *)(SCB_BASE + 0x020)))//System Handler Priority Register 3, SHPR3 on page B3 - 273
    volatile uint32_t SHCSR; //(*((volatile unsigned long *)(SCB_BASE + 0x024)))//System Handler Control and State Register, SHCSR on page C1 - 329d
    volatile uint32_t DFSR; //(*((volatile unsigned long *)(SCB_BASE + 0x030)))//Debug Fault Status Register, DFSR on page C1-330d
} ARMTypeDef;

// PWM 8ch
typedef struct
{
    volatile uint32_t GEN_CR; //(PWM_BASE + 0x280) //8通道使能控制
    volatile uint32_t INTSTATUS; //(PWM_BASE + 0x284) //8通道中断状态
    volatile uint32_t INTSTATUSSET; //(PWM_BASE + 0x288) //
    volatile uint32_t INTSTATUSCLR; //(PWM_BASE + 0x28C)
    volatile uint32_t INTEN; //(PWM_BASE + 0x290) //8通道中断使能
    volatile uint32_t INTENSET; //(PWM_BASE + 0x294)
    volatile uint32_t INTENCLR; //(PWM_BASE + 0x298)
} PWMGLBTypeDef;

typedef struct
{
    volatile uint32_t CR;    //(PWM_BASE + 0x000)//PWMDMA模式控制寄存器
    volatile uint32_t DMACR; //(PWM_BASE + 0x004)//PWMDMA模式控制寄存器
    volatile uint32_t MRUSERSET0; //(PWM_BASE + 0x008)//USER模式bit0预匹配
    volatile uint32_t MRUSERSET1; //(PWM_BASE + 0x00C)//USER模式bit1预匹配
    volatile uint32_t MRINI0; //(PWM_BASE + 0x010)//固定输出配置0预匹配值
    volatile uint32_t MRINI1; //(PWM_BASE + 0x014)//固定输出配置1预匹配值
    volatile uint32_t MRINI2; //(PWM_BASE + 0x018)//固定输出配置2预匹配值
    volatile uint32_t MRIDLE; //(PWM_BASE + 0x01C)//IDLE输出预匹配值
    volatile uint32_t DR;     //(PWM_BASE + 0x020)//数据寄存器
    volatile uint32_t IER;    //(PWM_BASE + 0x024)//PWM中断使能寄存器
    volatile uint32_t IFR;    //(PWM_BASE + 0x028)//PWM中断标志寄存器
    volatile uint32_t ISR;    //(PWM_BASE + 0x02C)//PWM中断状态寄存器
    volatile uint32_t DSR;    //(PWM_BASE + 0x030)//PWM数据状态寄存器
    volatile uint32_t ENSTOPCR; //(PWM_BASE + 0x034)//PWM紧急停机控制寄存器
    volatile uint32_t PHASEDELAYDR; //(PWM_BASE + 0x038)//PWM相位延迟数据寄存器
    volatile uint32_t DEADZONETIMEDR; //(PWM_BASE + 0x03C)//PWM死区时间数据寄存器
} PWMTypeDef;

