OpenAtomFoundation/TobudOS/platform/vendor_bsp/nationz/N32G020XX/cmsis/cm0/device/n32g020xx/n32g020xx.h
// UART
typedef struct
{
    volatile uint32_t RES;  //(UART_BASE + 0x000)// NONE
    volatile uint32_t ISR;  //(UART_BASE + 0x004)//UART中断状态寄存器
    volatile uint32_t IER;  //(UART_BASE + 0x008)//UART中断使能寄存器
    volatile uint32_t CR;   //(UART_BASE + 0x00C)//UART控制寄存器
    volatile uint32_t BRPL; //(UART_BASE + 0x010)//UART波特率低位寄存器
    volatile uint32_t BRPH; //(UART_BASE + 0x014)//UART波特率高位存器
    volatile uint32_t DR;   //(UART_BASE + 0x018)//UART数据寄存器
    volatile uint32_t CR1; //(UART_BASE + 0x01c)//UART流控模式控制寄存器
} UARTTypeDef;

// TIMER
typedef struct
{
    volatile uint32_t CSR; // T0状态控制寄存器
    volatile uint32_t CR;  //定时初值寄存器
    volatile uint32_t CVR; //当前计数值寄存器
} TIMERTypeDef;

// CRC
typedef struct
{
    volatile uint32_t CR;  //(CRC_BASE + 0x000)//CRC控制寄存器
    volatile uint32_t DR;  //(CRC_BASE + 0x004)//CRC待校验数据寄存器
    volatile uint32_t H8R; //(CRC_BASE + 0x008)//CRC高8位校验结果
    volatile uint32_t L8R; //(CRC_BASE + 0x00C)//CRC低8位校验结果
    volatile uint32_t LRC; //(CRC_BASE + 0x010)//LRC校验值寄存器
} CRCTypeDef;

// USB
typedef struct
{
    volatile uint32_t RESERVE1;//(*((volatile unsigned long *)(USB_BASE + 0x27C)))
    volatile uint32_t RESERVE2;//(*((volatile unsigned long *)(USB_BASE + 0x280)))
    volatile uint32_t RESERVE3;//(*((volatile unsigned long *)(USB_BASE + 0x284)))	
    volatile uint32_t RESERVE4;//(*((volatile unsigned long *)(USB_BASE + 0x288)))
    volatile uint32_t EPCSR; //(*((volatile unsigned long *)(USB_BASE + 0x28C)))
    volatile uint32_t EP0CSR; //(*((volatile unsigned long *)(USB_BASE + 0x290)))
    volatile uint32_t EP0BCR; //(*((volatile unsigned long *)(USB_BASE + 0x294)))
    volatile uint32_t EP1CSR; //(*((volatile unsigned long *)(USB_BASE + 0x298)))
    volatile uint32_t EP2CSR; //(*((volatile unsigned long *)(USB_BASE + 0x29C)))
    volatile uint32_t RESERVE5;//(*((volatile unsigned long *)(USB_BASE + 0x2A0)))
    volatile uint32_t RESERVE6;//(*((volatile unsigned long *)(USB_BASE + 0x2A4)))
    volatile uint32_t RESERVE7;//(*((volatile unsigned long *)(USB_BASE + 0x2A8)))
    volatile uint32_t EP5CSR; //(*((volatile unsigned long *)(USB_BASE + 0x2AC)))
    volatile uint32_t EP2BCR; //(*((volatile unsigned long *)(USB_BASE + 0x2B0)))
    volatile uint32_t EP3CSR; //(*((volatile unsigned long *)(USB_BASE + 0x2B4)))
    volatile uint32_t EP4CSR; //(*((volatile unsigned long *)(USB_BASE + 0x2B8)))
    volatile uint32_t EP4BCR; //(*((volatile unsigned long *)(USB_BASE + 0x2BC)))
    volatile uint32_t RESERVE8;//(*((volatile unsigned long *)(USB_BASE + 0x2C0)))
    volatile uint32_t SUDFIFO; //(*((volatile unsigned long *)(USB_BASE + 0x2C4)))
    volatile uint32_t EP0IFIFO; //(*((volatile unsigned long *)(USB_BASE + 0x2C8)))
    volatile uint32_t EP0OFIFO; //(*((volatile unsigned long *)(USB_BASE + 0x2CC)))
    volatile uint32_t EP1FIFO; //(*((volatile unsigned long *)(USB_BASE + 0x2D0)))
    volatile uint32_t EP2FIFO; //(*((volatile unsigned long *)(USB_BASE + 0x2D4)))
    volatile uint32_t EP3FIFO; //(*((volatile unsigned long *)(USB_BASE + 0x2D8)))
    volatile uint32_t EP4FIFO; //(*((volatile unsigned long *)(USB_BASE + 0x2DC)))
    volatile uint32_t RESERVE9;//(*((volatile unsigned long *)(USB_BASE + 0x2E0)))
    volatile uint32_t USBIE; // (*((volatile unsigned long *)(USB_BASE + 0x2E4)))
    volatile uint32_t USBIR; // (*((volatile unsigned long *)(USB_BASE + 0x2E8)))
    volatile uint32_t EPIE; //(*((volatile unsigned long *)(USB_BASE + 0x2EC)))
    volatile uint32_t EPIR; // (*((volatile unsigned long *)(USB_BASE + 0x2F0)))
    volatile uint32_t TKIE; //(*((volatile unsigned long *)(USB_BASE + 0x2F4)))
    volatile uint32_t TKIR; //(*((volatile unsigned long *)(USB_BASE + 0x2F8)))
    volatile uint32_t DEVCFG; //(*((volatile unsigned long *)(USB_BASE + 0x2FC)))
    volatile uint32_t RESERVE10; //(*((volatile unsigned long *)(USB_BASE + 0x300)))
    volatile uint32_t RESERVE11; //(*((volatile unsigned long *)(USB_BASE + 0x304)))
    volatile uint32_t RESERVE12; //(*((volatile unsigned long *)(USB_BASE + 0x308)))
    volatile uint32_t RESERVE13; //(*((volatile unsigned long *)(USB_BASE + 0x30C)))
    volatile uint32_t TIR; //(*((volatile unsigned long *)(USB_BASE + 0x310)))
    volatile uint32_t RESERVE14;//(*((volatile unsigned long *)(USB_BASE + 0x314)))
    volatile uint32_t RESERVE15;//(*((volatile unsigned long *)(USB_BASE + 0x318)))
    volatile uint32_t UFMSR; //(*((volatile unsigned long *)(USB_BASE + 0x31C)))
    volatile uint32_t RESERVE16[7];//(*((volatile unsigned long *)(USB_BASE + 0x320~0x338)))
    volatile uint32_t EP5FIFO; //(*((volatile unsigned long *)(USB_BASE + 0x33C)))
    volatile uint32_t DEVCFG2; //(*((volatile unsigned long *)(USB_BASE + 0x340)))
    volatile uint32_t EPCSR2; //(*((volatile unsigned long *)(USB_BASE + 0x344)))
    volatile uint32_t EP6CSR; //(*((volatile unsigned long *)(USB_BASE + 0x348)))
    volatile uint32_t EP7CSR; //(*((volatile unsigned long *)(USB_BASE + 0x34C)))
    volatile uint32_t EP7BCR; //(*((volatile unsigned long *)(USB_BASE + 0x350)))
    volatile uint32_t EPIE2; //(*((volatile unsigned long *)(USB_BASE + 0x354)))
    volatile uint32_t EPIR2; //(*((volatile unsigned long *)(USB_BASE + 0x358)))
    volatile uint32_t EP6FIFO; //(*((volatile unsigned long *)(USB_BASE + 0x35C)))
    volatile uint32_t EP7FIFO; //(*((volatile unsigned long *)(USB_BASE + 0x360)))
} USBTypeDef;

// I2C
typedef struct
{
    volatile uint32_t ADR; //(I2C0_BASE+0X00)//I2C0地址寄存器
    volatile uint32_t FDR; //(I2C0_BASE+0X04)//I2C0预分频寄存器
    volatile uint32_t CR;  //(I2C0_BASE+0X08)//I2C0控制寄存器
    volatile uint32_t SR;  //(I2C0_BASE+0X0C)//I2C0状态寄存器
    volatile uint32_t DR;  //(I2C0_BASE+0X10)//I2C0数据寄存器
} I2CTypeDef;

// ADC
typedef struct
{
    volatile uint32_t ISR;
    volatile uint32_t IFR;
    volatile uint32_t IER;
    volatile uint32_t CR1;
    volatile uint32_t CR2;
    volatile uint32_t DATCHSTS;
    volatile uint32_t DMACR;
    volatile uint32_t FIFO;
} ADCTypeDef;

// DAC
typedef struct
{
    volatile uint32_t CR;      // (DAC_BASE+0X00)//DAC控制寄存器
    volatile uint32_t FIFO;    //(DAC_BASE+0X04)//DACFIFO寄存器
    volatile uint32_t ONE;     //(DAC_BASE+0X08)//DAC输出1数据寄存器
    volatile uint32_t ZERO;    //(DAC_BASE+0X0C)//DAC输出0数据寄存器
    volatile uint32_t FIFOSTS; //(DAC_BASE+0X10)//DACFIFO状态寄存器
    volatile uint32_t FIFOINTEN; //(DAC_BASE+0X14)//DACFIFO中断使能寄存器
    volatile uint32_t REG;       //(DAC_BASE+0X18)//DAC输出数据寄存器
} DACTypeDef;

// MICDET
typedef struct
{
    volatile uint32_t CR1; //(DACOUT_BASE + 0x00)
    volatile uint32_t CR2; //(DACOUT_BASE + 0x04)
} DACOUTTypeDef;

// WDT
typedef struct
{
    volatile uint32_t TAP; //(WDT_BASE + 0x000)//WDT写保护寄存器
    volatile uint32_t CSR; //(WDT_BASE + 0x004)//WDT状态控制寄存器
} WDTTypeDef;

// SPIS
typedef struct
{
    volatile uint32_t CR;   //(SPIS0_BASE + 0x000) ///< base address
    volatile uint32_t SR;   //(SPIS0_BASE + 0x004) ///< base address
    volatile uint32_t DCR;  //(SPIS0_BASE + 0x008) ///< base address
    volatile uint32_t DSR;  //(SPIS0_BASE + 0x00C) ///< base address
    volatile uint32_t IER;  //(SPIS0_BASE + 0x010) ///< base address
    volatile uint32_t IFR;  //(SPIS0_BASE + 0x014) ///< base address
    volatile uint32_t UDR;  //(SPIS0_BASE + 0x018) ///< base address
    volatile uint32_t RES[25]; // reserved
    volatile uint32_t DATA; //(SPIS0_BASE + 0x080) ///< base address
} SPISTypeDef;

// SPIM
typedef struct
{
    volatile uint32_t CR;       //(SPIM0_BASE + 0x000) ///< base address
    volatile uint32_t BAUD1;    //(SPIM0_BASE + 0x004) ///< base address
    volatile uint32_t EN;       //(SPIM0_BASE + 0x008) ///< base address
    volatile uint32_t IER;      //(SPIM0_BASE + 0x00C) ///< base address
    volatile uint32_t BAUD2;    //(SPIM0_BASE + 0x010) ///< base address
    volatile uint32_t ISR;      //(SPIM0_BASE + 0x014) ///< base address
    volatile uint32_t DSR;      //(SPIM0_BASE + 0x018) ///< base address
    volatile uint32_t DR;       //(SPIM0_BASE + 0x01C) ///< base address
    volatile uint32_t RXCNT;    //(SPIM0_BASE + 0x020) ///< base address
    volatile uint32_t TXCNT;    //(SPIM0_BASE + 0x024) ///< base address
    volatile uint32_t DUMMYNUM; //(SPIM0_BASE + 0x028) ///< base address
} SPIMTypeDef;

