OpenAtomFoundation/TobudOS/platform/vendor_bsp/nationz/N32G020XX/cmsis/cm0/device/n32g020xx/n32g020xx.h
// RTC---TBC
typedef struct
{
    volatile uint32_t ADJ;      //(RTC_BASE + 0x000) ///< base address
    volatile uint32_t START;    //(RTC_BASE + 0x004) ///< base address
    volatile uint32_t DRUPDATE; //(RTC_BASE + 0x008) ///< base address
    volatile uint32_t DR;       //(RTC_BASE + 0x00C) ///< base address
    volatile uint32_t INTSTS;   //(RTC_BASE + 0x010) ///< base address
    volatile uint32_t INTSTSEN; //(RTC_BASE + 0x014) ///< base address
} RTCTypeDef;

// RCVCNT
typedef struct
{
    volatile uint32_t CR;     //(RCVCNT_BASE + 0x000) ///< base address
    volatile uint32_t IS;    //(RCVCNT_BASE + 0x004) ///< base address
    volatile uint32_t CNT0HR; //(RCVCNT_BASE + 0x008) ///< base address
    volatile uint32_t CNT0LR; //(RCVCNT_BASE + 0x00C) ///< base address
    volatile uint32_t CNT1HR; //(RCVCNT_BASE + 0x010) ///< base address
    volatile uint32_t CNT1LR; //(RCVCNT_BASE + 0x014) ///< base address
    volatile uint32_t RCVR;   //(RCVCNT_BASE + 0x018) ///< base address
    volatile uint32_t CTHRL;   //(RCVCNT_BASE + 0x01C) ///< base address
    volatile uint32_t CTHRH;   //(RCVCNT_BASE + 0x020) ///< base address
} RCVCNTTypeDef;

// RCVCNT_INT
typedef struct
{
    volatile uint32_t INT_STATUS; //(RCVCNT_INT_BASE + 0x00) //RCVCNT_INT中断状态总寄存器
    volatile uint32_t INT_SET_STATUS; //(RCVCNT_INT_BASE + 0x04) //RCVCNT_INT中断状态置位总寄存器
    volatile uint32_t INT_CLR_STATUS; //(RCVCNT_INT_BASE + 0x08)  //RCVCNT_INT中断状态清零总寄存器
    volatile uint32_t INT_ENABLE; //(RCVCNT_INT + 0x0C)  //RCVCNT_INT中断输出总使能寄存器
    volatile uint32_t INT_SET_ENABLE; //(RCVCNT_INT + 0x10)  //RCVCNT_INT中断输出总使能置位寄存器
    volatile uint32_t INT_CLR_ENABLE; //(RCVCNT_INT + 0x14) //RCVCNT_INT中断输出总使能清零寄存器
} RCVCNTIntTypeDef;

// PMU Power Management Unit
typedef struct
{
    volatile uint32_t RES[3];          //(PMU_BASE + 0x00)
    volatile uint32_t WKSREN0;        //(PMU_BASE + 0x0C)
    volatile uint32_t WKSREN1;        //(PMU_BASE + 0x10)
    volatile uint32_t WKEXTINEN;      //(PMU_BASE + 0x14)
    volatile uint32_t WKEXTINEN_SET;  //(PMU_BASE + 0x18)
    volatile uint32_t WKEXTINEN_CLR;  //(PMU_BASE + 0x1C)
    volatile uint32_t WKEXTINSTR;     //(PMU_BASE + 0x20)
    volatile uint32_t WKEXTINSTR_SET; //(PMU_BASE + 0x24)
    volatile uint32_t WKEXTINSTR_CLR; //(PMU_BASE + 0x28)
    volatile uint32_t WKSTR0;         //(PMU_BASE + 0x2C)
    volatile uint32_t WKSTR1;         //(PMU_BASE + 0x30)
    volatile uint32_t WKSTR2;         //(PMU_BASE + 0x34)
    volatile uint32_t WKSTR3;         //(PMU_BASE + 0x38)
    volatile uint32_t WKSTR4;         //(PMU_BASE + 0x3C)
} PMUTypeDef;

// Retention pum
typedef struct
{
    volatile uint32_t CTRL;        //(RETPMU_BASE + 0x00)
    volatile uint32_t XO32K_CTRL1; //(RETPMU_BASE + 0x04)
    volatile uint32_t XO32K_CTRL2; //(RETPMU_BASE + 0x08)
    volatile uint32_t RC32K_CTRL1; //(RETPMU_BASE + 0x0C)
    volatile uint32_t RC32K_CTRL2; //(RETPMU_BASE + 0x10)
    volatile uint32_t RES2;        //(RETPMU_BASE + 0x14)
    volatile uint32_t RTCWUP_CTRL; //(RETPMU_BASE + 0x18)
    volatile uint32_t ON_STAT;     //(RETPMU_BASE + 0x1C)
} RETPMUTypeDef;

// SMC System Management Control
typedef struct
{
    volatile uint32_t RC32KCFG0; //(SMC_BASE + 0x00)
    volatile uint32_t RC32KCFG1; //(SMC_BASE + 0x04)
    volatile uint32_t XO32KCFG0; //(SMC_BASE + 0x08)
    volatile uint32_t XO32KCFG1; //(SMC_BASE + 0x0C)
    volatile uint32_t RETLDOCFG; //(SMC_BASE + 0x10)
    volatile uint32_t SRAMCFG0;  //(SMC_BASE + 0x14)
    volatile uint32_t SRAMCFG1;  //(SMC_BASE + 0x18)
    volatile uint32_t SRAMCFG2;  //(SMC_BASE + 0x1C)
    volatile uint32_t SRAMCFG3;  //(SMC_BASE + 0x20)
    volatile uint32_t SRAMCFG4;  //(SMC_BASE + 0x24)
    volatile uint32_t SRAMCFG5;  //(SMC_BASE + 0x28)
    volatile uint32_t SRAMCFG6;  //(SMC_BASE + 0x2C)
    volatile uint32_t SRAMCFG7;  //(SMC_BASE + 0x30)
    volatile uint32_t SRAMCFG8;  //(SMC_BASE + 0x34)
    volatile uint32_t SRAMCFG9;  //(SMC_BASE + 0x38)
    volatile uint32_t SRAMCFG10; //(SMC_BASE + 0x3C)
    volatile uint32_t INITSTS;   //(SMC_BASE + 0x40)
} SMCTypeDef;

// CGU  Clock Generation Unit
typedef struct
{
    volatile uint32_t RES[3];    //(CGU_BASE + 0x00)
    volatile uint32_t CLK80MDIV1;   //(CGU_BASE + 0x0C)
    volatile uint32_t CLK80MDIV2;   //(CGU_BASE + 0x10)
    volatile uint32_t USBCLKCR;     //(CGU_BASE + 0x14)
    volatile uint32_t MCGR1;        //(CGU_BASE + 0x18)
    volatile uint32_t MCGR2;        //(CGU_BASE + 0x1C)
    volatile uint32_t MCGR3;        //(CGU_BASE + 0x20)
    volatile uint32_t MCGR4;        //(CGU_BASE + 0x24)
    volatile uint32_t MCGR5;        //(CGU_BASE + 0x28)
    volatile uint32_t MCGR6;        //(CGU_BASE + 0x2C)
    volatile uint32_t ALGCGR;       //(CGU_BASE + 0x30)
    volatile uint32_t RES0;
    volatile uint32_t WDTCLKCR;   //(CGU_BASE + 0x38)
    volatile uint32_t UART0CLKCR; //(CGU_BASE + 0x3C)
    volatile uint32_t UART1CLKCR; //(CGU_BASE + 0x40)
    volatile uint32_t UART2CLKCR; //(CGU_BASE + 0x44)
    volatile uint32_t TMRCLKSEL;  //(CGU_BASE + 0x48)
    volatile uint32_t TMR0CLKCR;  //(CGU_BASE + 0x4C)
    volatile uint32_t TMR1CLKCR;  //(CGU_BASE + 0x50)
    volatile uint32_t TMR2CLKCR;  //(CGU_BASE + 0x54)
    volatile uint32_t TMR3CLKCR;  //(CGU_BASE + 0x58)
    volatile uint32_t TMR4CLKCR;  //(CGU_BASE + 0x5C)
    volatile uint32_t RES1;
    volatile uint32_t DACCLKFDR0;  //(CGU_BASE + 0x64)
    volatile uint32_t DACCLKFDR1;  //(CGU_BASE + 0x68)
    volatile uint32_t DACCLKCR;    //(CGU_BASE + 0x6C)
    volatile uint32_t ADCCLKFDR0;  //(CGU_BASE + 0x70)
    volatile uint32_t ADCCLKFDR1;  //(CGU_BASE + 0x74)
    volatile uint32_t ADCCLKCR;    //(CGU_BASE + 0x78)
    volatile uint32_t SCCCLKCR;    //(CGU_BASE + 0x7c)
    volatile uint32_t RES2[2];
    volatile uint32_t OSCRNGCR;    //(CGU_BASE + 0x88)
    volatile uint32_t RES3[18];
    volatile uint32_t DIVSR0;   //(CGU_BASE + 0xD4)
    volatile uint32_t DIVSR1;   //(CGU_BASE + 0xD8)
    volatile uint32_t RES4[4];
    volatile uint32_t OSC80MOUTCR; //(CGU_BASE + 0xEC)
    volatile uint32_t CLKSRCFREQCR;  //(CGU_BASE + 0xF0)
    volatile uint32_t RES5[2];
    volatile uint32_t PWMRCVCLKCR; //(CGU_BASE + 0xFC)
} CGUTypeDef;

// RCU Reset Control Unit
typedef struct
{
    volatile uint32_t CR0;    //(RCU_BASE + 0x00)
    volatile uint32_t CR1;    //(RCU_BASE + 0x04)
    volatile uint32_t CR1_SET; //(RCU_BASE + 0x08)
    volatile uint32_t CR1_CLR; //(RCU_BASE + 0x0C)
    volatile uint32_t CR2;    //(RCU_BASE + 0x10)
    volatile uint32_t CR2_SET; //(RCU_BASE + 0x14)
    volatile uint32_t CR2_CLR; //(RCU_BASE + 0x18)
    volatile uint32_t CR3;    //(RCU_BASE + 0x1C)
    volatile uint32_t CR3_SET; //(RCU_BASE + 0x20)
    volatile uint32_t CR3_CLR; //(RCU_BASE + 0x24)
    volatile uint32_t SR0;    //(RCU_BASE + 0x28)
    volatile uint32_t SR1;    //(RCU_BASE + 0x2C)
} RCUTypeDef;

// IOM IO Multiplex
typedef struct
{
    volatile uint32_t INTPEGA;   //(IOM_BASE + 0x00)
    volatile uint32_t INTNEGA;   //(IOM_BASE + 0x04)
    volatile uint32_t INTPEGB;   //(IOM_BASE + 0x08)
    volatile uint32_t INTNEGB;   //(IOM_BASE + 0x0c)
    volatile uint32_t INTPEGC;   //(IOM_BASE + 0x10)
    volatile uint32_t INTNEGC;   //(IOM_BASE + 0x14)
    volatile uint32_t INTPEGD;   //(IOM_BASE + 0x18)
    volatile uint32_t INTNEGD;   //(IOM_BASE + 0x1c)
    volatile uint32_t INTSTATA;  //(IOM_BASE + 0x20)
    volatile uint32_t INTSTATB;  //(IOM_BASE + 0x24)
    volatile uint32_t INTSTATC;  //(IOM_BASE + 0x28)
    volatile uint32_t INTSTATD;  //(IOM_BASE + 0x2c)
    volatile uint32_t INTSTATE;  //(IOM_BASE + 0x30)
    volatile uint32_t WUENA;     //(IOM_BASE + 0x34)
    volatile uint32_t WUENB;     //(IOM_BASE + 0x38)
    volatile uint32_t WUENC;     //(IOM_BASE + 0x3C)
    volatile uint32_t WUEND;     //(IOM_BASE + 0x40)
    volatile uint32_t WULEVELA;  //(IOM_BASE + 0x44)
    volatile uint32_t WULEVELB;  //(IOM_BASE + 0x48)
    volatile uint32_t WULEVELC;  //(IOM_BASE + 0x4C)
    volatile uint32_t CR1;       //(IOM_BASE + 0x50)
    volatile uint32_t CR2;       //(IOM_BASE + 0x54)
    volatile uint32_t CR3;       //(IOM_BASE + 0x58)
    volatile uint32_t CR4;       //(IOM_BASE + 0x5c)
    volatile uint32_t CR5;       //(IOM_BASE + 0x60)
    volatile uint32_t CR6;       //(IOM_BASE + 0x64)
    volatile uint32_t CR7;       //(IOM_BASE + 0x68)
    volatile uint32_t CR8;       //(IOM_BASE + 0x6c)
    volatile uint32_t CR9;       //(IOM_BASE + 0x70)
    volatile uint32_t CR10;      //(IOM_BASE + 0x74)
    volatile uint32_t CR11;      //(IOM_BASE + 0x78)
    volatile uint32_t CR12;      //(IOM_BASE + 0x7c)
    volatile uint32_t CR13;      //(IOM_BASE + 0x80)
    volatile uint32_t CR14;      //(IOM_BASE + 0x84)
    volatile uint32_t CR15;      //(IOM_BASE + 0x88)
    volatile uint32_t RES1;      //(IOM_BASE + 0x8C)
    volatile uint32_t GPIODRA;   //(IOM_BASE + 0x90)
    volatile uint32_t GPIODRB;   //(IOM_BASE + 0x94)
    volatile uint32_t GPIODRC;   //(IOM_BASE + 0x98)
    volatile uint32_t GPIODRD;   //(IOM_BASE + 0x9C)
    volatile uint32_t GPIOOEA;   //(IOM_BASE + 0xA0)
    volatile uint32_t GPIOOEB;   //(IOM_BASE + 0xA4)
    volatile uint32_t GPIOOEC;   //(IOM_BASE + 0xa8)
    volatile uint32_t GPIOOED;   //(IOM_BASE + 0xac)
    volatile uint32_t GPIOIEA;   //(IOM_BASE + 0xB0)
    volatile uint32_t GPIOIEB;   //(IOM_BASE + 0xB4)
    volatile uint32_t GPIOIEC;   //(IOM_BASE + 0xB8)
    volatile uint32_t GPIOIED;   //(IOM_BASE + 0xBC)
    volatile uint32_t GPIOPUA;   //(IOM_BASE + 0xC0)
    volatile uint32_t GPIOPUB;   //(IOM_BASE + 0xC4)
    volatile uint32_t GPIOPUC;   //(IOM_BASE + 0xC8)
    volatile uint32_t GPIOPUD;   //(IOM_BASE + 0xCC)
    volatile uint32_t GPIOPDA;   //(IOM_BASE + 0xD0)
    volatile uint32_t GPIOPDB;   //(IOM_BASE + 0xD4)
    volatile uint32_t GPIOPDC;   //(IOM_BASE + 0xD8)
    volatile uint32_t GPIOPDD;   //(IOM_BASE + 0xDC)
    volatile uint32_t GPIOSMTA;  //(IOM_BASE + 0xE0)
    volatile uint32_t GPIOSMTB;  //(IOM_BASE + 0xE4)
    volatile uint32_t GPIOSMTC;  //(IOM_BASE + 0xE8)
    volatile uint32_t GPIOSMTD;  //(IOM_BASE + 0xEC)
    volatile uint32_t GPIOPINA1; //(IOM_BASE + 0xF0)
    volatile uint32_t GPIOPINA2; //(IOM_BASE + 0xF4)
    volatile uint32_t GPIOPINB1; //(IOM_BASE + 0xF8)
    volatile uint32_t GPIOPINB2; //(IOM_BASE + 0xFC)
    volatile uint32_t GPIOPINC1; //(IOM_BASE + 0x100)
    volatile uint32_t GPIOPINC2; //(IOM_BASE + 0x104)
    volatile uint32_t GPIOPIND1; //(IOM_BASE + 0x108)
    volatile uint32_t GPIOPIND2; //(IOM_BASE + 0x10C)
    volatile uint32_t RES2;      //(IOM_BASE + 0x110)
    volatile uint32_t PWMEMSTP;  //(IOM_BASE + 0x114)
} IOMTypeDef;

