OpenAtomFoundation/TobudOS/platform/vendor_bsp/nationz/N32G020XX/cmsis/cm0/device/n32g020xx/n32g020xx.h
// AFEC Analog Front End Control
typedef struct
{
    volatile uint32_t RES1;      //(AFEC_BASE + 0x00)
    volatile uint32_t LDOCR2;    //(AFEC_BASE + 0x04)
    volatile uint32_t OSC80MCR1; //(AFEC_BASE + 0x08)
    volatile uint32_t COMPCR1;   //(AFEC_BASE + 0x0C)
    volatile uint32_t REV1CR;    //(AFEC_BASE + 0x10)
    volatile uint32_t REV2CR;    //(AFEC_BASE + 0x14)
    volatile uint32_t XO12MCR1;  //(AFEC_BASE + 0x18)
    volatile uint32_t OSC300MCR; //(AFEC_BASE + 0x1C)
    volatile uint32_t USBCR1;    //(AFEC_BASE + 0x20)
    volatile uint32_t USBCR2;    //(AFEC_BASE + 0x24)
    volatile uint32_t USBCR3;    //(AFEC_BASE + 0x28)
    volatile uint32_t USBREVCR;  //(AFEC_BASE + 0x2C)
    volatile uint32_t RES0[0x0B];
    volatile uint32_t CR; //(AFEC_BASE + 0x5C)
} AFECTypeDef;

// SCD
typedef struct
{
    volatile uint32_t ISR1; //(SCD_BASE + 0x000) ///< interrupt status 1
    volatile uint32_t IER1; //(SCD_BASE + 0x004) ///< interrupt enable 1
    volatile uint32_t ISR2; //(SCD_BASE + 0x008) ///< base address
    volatile uint32_t IER2; //(SCD_BASE + 0x00C) ///< base address
    volatile uint32_t CR1;  //(SCD_BASE + 0x010) ///< control1
    volatile uint32_t CR2;  //(SCD_BASE + 0x014) ///< base address
    volatile uint32_t CRCINITSET; //(SCD_BASE + 0x018) ///< crc ininial set
    volatile uint32_t TDR;        //(SCD_BASE + 0x01C) ///< transfer data
    volatile uint32_t RDR;        //(SCD_BASE + 0x020) ///< receive data
    volatile uint32_t BPRL;       //(SCD_BASE + 0x024) ///< baudrate low
    volatile uint32_t BPRH;       //(SCD_BASE + 0x028) ///< base address
    volatile uint32_t CRCDATA;    //    (SCD_BASE + 0x02C)//
    volatile uint32_t CRCL;       //(SCD_BASE + 0x030)// crc value low
    volatile uint32_t CRCH;       //(SCD_BASE + 0x034)//
    volatile uint32_t EECRL;      //(SCD_BASE + 0x038)// extetu low
    volatile uint32_t EECRH;      //(SCD_BASE + 0x03C)//
    volatile uint32_t GTRH;       //(SCD_BASE + 0x040)// guard time
    volatile uint32_t ETUEN;      //(SCD_BASE + 0x044)// etu en
} SCDTypeDef;

// SCC
typedef struct
{
    volatile uint32_t SR;         //(SCC_BASE + 0x000) ///< base address
    volatile uint32_t IER;        //(SCC_BASE + 0x004) ///< base address
    volatile uint32_t TCR;        //(SCC_BASE + 0x008) ///< base address
    volatile uint32_t UCR;        //(SCC_BASE + 0x00C) ///< base address
    volatile uint32_t DR;         //(SCC_BASE + 0x010) ///< base address
    volatile uint32_t BPRL;       //(SCC_BASE + 0x014) ///< base address
    volatile uint32_t BPRH;       //(SCC_BASE + 0x018) ///< base address
    volatile uint32_t UCR1;       //(SCC_BASE + 0x01C) ///< base address
    volatile uint32_t SR1;        //(SCC_BASE + 0x020) ///< base address
    volatile uint32_t IER1;       //(SCC_BASE + 0x024) ///< base address
    volatile uint32_t ECNTL;      //(SCC_BASE + 0x028) ///< base address
    volatile uint32_t ECNTH;      //(SCC_BASE + 0x02C)//
    volatile uint32_t GTR;        //(SCC_BASE + 0x030)//
    volatile uint32_t RETXCNT;    //(SCC_BASE + 0x034)//
    volatile uint32_t RETXCNTRMI; //(SCC_BASE + 0x038)//
} SCCTypeDef;

// DAMC
typedef struct
{
    struct
    {
        volatile uint32_t SRCADDR; //(DMA_BASE + (ch)*0x10 + 0x00)< source address
        volatile uint32_t DSTADDR; //(DMA_BASE + (ch)*0x10 + 0x04)< destination address
        volatile uint32_t CHCTRL; //(DMA_BASE + (ch)*0x10 + 0x08)< channel control
        volatile uint32_t CHSTS; //(DMA_BASE + (ch)*0x10 + 0x0C)< channel status
    } DMACHL[DMAC_MAX_CHANNEL];

    volatile uint32_t EN;              //(DMA_BASE + 0x80)
    volatile uint32_t SOFTRESET;       //(DMA_BASE + 0x84)
    volatile uint32_t INTSTATUS;       //(DMA_BASE + 0x88)
    volatile uint32_t INTMASK;         //(DMA_BASE + 0x8C)
    volatile uint32_t BASICINFM;       //(DMA_BASE + 0x90)
    volatile uint32_t PERREQ;          //(DMA_BASE + 0x94)
    volatile uint32_t RES1;            //(DMA_BASE + 0x98)
    volatile uint32_t RES2;            //(DMA_BASE + 0x9C)
    volatile uint32_t INTRAMCLRSTATUS; //(DMA_BASE + 0xa0)
    volatile uint32_t INTRAMCLRMASK;   //(DMA_BASE + 0xa4)
    volatile uint32_t RAMCLROPT;       //(DMA_BASE + 0xa8)
} DMACTypeDef;

// FLASH
typedef struct
{
    volatile uint32_t CR;  //(FLASH_BASE + 0x000)  // 控制寄存器
    volatile uint32_t OPR; //(FLASH_BASE + 0x004)  // 操作码寄存器
    volatile uint32_t IER; //(FLASH_BASE + 0x008)  // 中断使能寄存器
    volatile uint32_t SR;  //(FLASH_BASE + 0x00C)  // 中断状态寄存器
    volatile uint32_t ADR; //(FLASH_BASE + 0x010)  // 校验地址寄存器
    volatile uint32_t TR;  //(FLASH_BASE + 0x014)  // 时间控制寄存器
    volatile uint32_t SECR; //(FLASH_BASE + 0x018)  // 报警状态寄存器，Chip复位域
} FLASHTypeDef;

// ICACHE
typedef struct
{
    volatile uint32_t CSR; //(ICACHE_BASE + 0x000)
} ICACHETypeDef;

// UCDR
typedef struct
{
    volatile uint32_t CTRL;    //(UCDR_BASE + 0X00)
    volatile uint32_t CLKUCDRDIV;  //(UCDR_BASE + 0X04)
    volatile uint32_t DTCMODESEL;  //(UCDR_BASE + 0X08)
    volatile uint32_t DlYCNTDEFT;  //(UCDR_BASE + 0X0C)
    volatile uint32_t DlYCNTDTC;   //(UCDR_BASE + 0X10)
    volatile uint32_t DlYCNTADJ;   //(UCDR_BASE + 0X14)
    volatile uint32_t CKCNTDEFT;   //(UCDR_BASE + 0X18)
    volatile uint32_t CKCNTDTC;    //   (UCDR_BASE + 0X1C)
    volatile uint32_t CKCNTADJ;    //   (UCDR_BASE + 0X20)
    volatile uint32_t BITWIDTHCNT; //(UCDR_BASE + 0X24)
    volatile uint32_t CKUNITDEFT;  //(UCDR_BASE + 0X28)
    volatile uint32_t CKUNITDTC;   //(UCDR_BASE + 0X2C)
    volatile uint32_t CKUNITADJ;   //(UCDR_BASE + 0X30)
    volatile uint32_t OSC300MCFG0; //(UCDR_BASE + 0X34)
    volatile uint32_t OSC300MCFG1; //(UCDR_BASE + 0X38)
    volatile uint32_t DlYCNTBIAS;  //(UCDR_BASE + 0X3C)
    volatile uint32_t RESERVE;  //(UCDR_BASE + 0X40)
    volatile uint32_t SYNCDTCFREQ; //(UCDR_BASE + 0X44)
} UCDRTypeDef;

// ADCDAC 0x5070 0000
typedef struct
{
    volatile uint32_t INTSTATUS;//RD ONLY
    volatile uint32_t INTSETSTATUS;//WR ONLY
    volatile uint32_t INTCLRSTATUS;//WR ONLY
    volatile uint32_t INTENABLE;//RD ONLY
    volatile uint32_t INTSETENABLE;//WR ONLY
    volatile uint32_t INTCLRENABLE;//WR ONLY
}ADCDACTypeDef;
//------------------------------------------------------------------------------
//                       REGISTER DEFINATION
//------------------------------------------------------------------------------
#define ARM ((ARMTypeDef*)SCB_BASE)
#define FLASH ((FLASHTypeDef*)FLASH_BASE)
#define CRC ((CRCTypeDef*)CRC_BASE)
#define USB ((USBTypeDef*)USBDC_BASE)
#define SPIM0 ((SPIMTypeDef*)SPIM0_BASE)
#define SPIM1 ((SPIMTypeDef*)SPIM1_BASE)
#define ICACHE ((ICACHETypeDef*)ICACHE_BASE)
#define SPIS0 ((SPISTypeDef*)SPIS0_BASE)
#define SPIS1 ((SPISTypeDef*)SPIS1_BASE)
#define I2C0 ((I2CTypeDef*)I2C0_BASE)
#define I2C1 ((I2CTypeDef*)I2C1_BASE)
#define TIMER0 ((TIMERTypeDef*)TIMER0_BASE)
#define TIMER1 ((TIMERTypeDef*)TIMER1_BASE)
#define TIMER2 ((TIMERTypeDef*)TIMER2_BASE)
#define TIMER3 ((TIMERTypeDef*)TIMER3_BASE)
#define TIMER4 ((TIMERTypeDef*)TIMER4_BASE)
#define SCC ((SCCTypeDef*)SCC_BASE)
#define SCD ((SCDTypeDef*)SCD_BASE)
#define ADC ((ADCTypeDef*)ADC_BASE)
#define PWM ((PWMTypeDef*)PWM_BASE)
#define PWM0 ((PWMTypeDef*)PWM0_BASE)
#define PWM1 ((PWMTypeDef*)PWM1_BASE)
#define PWM2 ((PWMTypeDef*)PWM2_BASE)
#define PWM3 ((PWMTypeDef*)PWM3_BASE)
#define PWM4 ((PWMTypeDef*)PWM4_BASE)
#define PWM5 ((PWMTypeDef*)PWM5_BASE)
#define PWM6 ((PWMTypeDef*)PWM6_BASE)
#define PWM7 ((PWMTypeDef*)PWM7_BASE)
#define PWMGLB ((PWMGLBTypeDef*)PWMGLB_BASE)
#define DAC ((DACTypeDef*)DAC_BASE)
#define DACOUT ((DACOUTTypeDef*)DACOUT_BASE)
#define UART0 ((UARTTypeDef*)UART0_BASE)
#define UART1 ((UARTTypeDef*)UART1_BASE)
#define UART2 ((UARTTypeDef*)UART2_BASE)
#define CGU ((CGUTypeDef*)CGU_BASE)
#define RCU ((RCUTypeDef*)RCU_BASE)
#define SMC ((SMCTypeDef*)SMC_BASE)
#define PMU ((PMUTypeDef*)PMU_BASE)
#define RETPMU ((RETPMUTypeDef*)RETPMU_BASE)
#define IOM ((IOMTypeDef*)IOM_BASE)
#define WDT ((WDTTypeDef*)WDT_BASE)
#define DMA ((DMACTypeDef*)DMA_BASE)
#define UCDR ((UCDRTypeDef*)UCDR_BASE)
#define RCVCNT ((RCVCNTTypeDef*)RCVCNT_BASE)
#define RCVCNT_INT ((RCVCNTIntTypeDef*)RCVCNT_INT_BASE) 
#define AFEC ((AFECTypeDef*)AFEC_BASE)
#define RTC ((RTCTypeDef*)RTC_BASE)
#define ADCDAC ((ADCDACTypeDef*)ADCDAC_BASE)

#ifdef __cplusplus
}
#endif

#endif //__N32G020XX_H__

/** @} */
